source/_posts/2014-01-25-using-rubymine-slash-intellij-regexp-search-slash-replace.html
---
layout: post
title: "Using RubyMine/IntelliJ Regexp Search/Replace"
date: 2014-01-25 09:05
comments: true
categories: [rubymine]
keywords: 
description: Tutorial and example of using Jetbrain's RubyMine and IntelliJ's interactive regexp search and replace.
canonical: https://www.shakacode.com/blog/using-rubymine-slash-intellij-regexp-search-slash-replace/
---

<p>
RubyMine's interactive search/replace is awesome. The Regexp feature is
especially useful. Not only will it help you edit faster, but it will improve
your ability to write RegExp's in your code. When do you need to use a regexp?
Whenever a standard find/replace won't cut it. For example, if you changing the
rspec syntax from one form to another, such as from:
</p>

{% codeblock lang:ruby %}
let(:my_subject) { something }
it { expect(my_subject.value).to eq(some_value) }
{% endcodeblock %}

<p>
to
</p>

{% codeblock lang:ruby %}
subject { something }
its(:value) { should eq(some_value) }  
{% endcodeblock %}

<!-- more -->

<p>
The following screencast shows how you can interactively use the Regexp feature
to figure out the right regexp to search for as well as the right replacement.
</p>

<p>
In this example, I'm replacing one rspec syntax with a replacement one.
</p>

<pre class="example">
it \{ expect\(my_subject\.(\w+)\)\.to eq\((.*)\) }
</pre>

<p>
Replace with:
</p>
<pre class="example">
its(:$1) { should eq($2) }
</pre>

<p>
Here's a few key tips:
</p>
<ol class="org-ol">
<li>Be sure to first check the regexp check-box if you'll need that.
</li>
<li>As you type each character into the search box, observe if you're increasing
your match area to get what you want.
</li>
<li>If a character doesn't match, then try escaping the character. For example,
I had to escape the <code>{</code> and <code>(</code> as those characters have special meaning in
the regexp.
</li>
<li>Once you get a match with the right groupings for replacement, then put in
the <code>$1</code>, <code>$2</code>, etc. into the replacement box to refine your replacement string.
</li>
<li>Then hit Opt-P (or Alt-P) to replace.
</li>
</ol>

<p>
This is best shown with this 2 minute screencast.
</p>

<p>
{% youtube U_UaOjcR4wQ %}
</p>
